In [74]:
#Importing Libaries ---->
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [75]:
#Establishing Connections --->
def create_server_connection(host_name, user_name, user_password):
    connection: None
    try:
        connection = mysql.connector.connect(
            host= host_name,
            user= user_name,
            passwd= user_password
        )
        print("MySQL Database Connection Established Successfully")
    except Error as err:
        print(f"Error: '(err)'")
    return connection

#Password ---->
pw= "SahilSL@1234"
#Database name ---->
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySQL Database Connection Established Successfully

In [76]:
# Create mysql_python Database ---->
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database Created Successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Database Created Successfully

In [77]:
#Connect to database ---->
def create_db_connection(host_name, user_name, user_password, db_name):
    connection: None
    try:
        connection = mysql.connector.connect(
            host= host_name,
            user= user_name,
            passwd= user_password,
            database= db_name)
        print("MySQL database Connection Succcessfully")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [78]:
#Execute SQL Queries ---->
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [79]:
create_orders_table = '''
CREATE TABLE orders( order_id INT PRIMARY KEY, customer_name VARCHAR(30), product_name VARCHAR(20) NOT NULL, date_ordered DATE, quantity INT, unit_price FLOAT, phone_number VARCHAR(20));
'''

#connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database Connection Succcessfully
Query executed successfully

In [80]:
#inserting data ---->
data_orders = """
insert into orders values
(101, 'Sahil', 'Laptop', '2002-12-02', 2, 800, '8087977227'),
(102, 'Jayesh', 'Book', '2019-02-10', 10, 12, '8369489124'),
(103, 'Soham', 'Tab', '2019-12-25', 5, 50, '8976123465'),
(104, 'Ninadh', 'Phone', '2018-07-14', 7, 30, '7368145099'),
(105, 'Mansi', 'TV', '2019-05-30', 6, 48, '8865316698'),
(106, 'Disha', 'Headphone', '2018-08-20', 10, 300, '7720130449');
"""

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database Connection Succcessfully
Query executed successfully

In [81]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [82]:
#select query---->
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q1)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [83]:
#select query---->
q2 = """
select customer_name, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q2)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [84]:
#select query---->
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q3)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [85]:
#select query---->
q4 = """
select distinct(year(date_ordered)) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q4)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [86]:
#select query---->
q5 = """
select * from orders where date_ordered < '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q5)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [87]:
#select query---->
q6 = """
select * from orders where date_ordered > '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q6)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [88]:
#select query---->
q7 = """
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pw, db)
result = read_query(connection, q7)
for result in results:
    print(values)

MySQL database Connection Succcessfully
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]
[(101, 'Sahil', 'Laptop', datetime.date(2002, 12, 2), 2, 800.0, '8087977227'), (106, 'Disha', 'Headphone', datetime.date(2018, 8, 20), 10, 300.0, '7720130449'), (103, 'Soham', 'Tab', datetime.date(2019, 12, 25), 5, 50.0, '8976123465'), (105, 'Mansi', 'TV', datetime.date(2019, 5, 30), 6, 48.0, '8865316698'), (104, 'Ninadh', 'Phone', datetime.date(2018, 7, 14), 7, 30.0, '7368145099'), (102, 'Jayesh', 'Book', datetime.date(2019, 2, 10), 10, 12.0, '8369489124')]

In [106]:
from_db =[]
for rsult in results:
    result = list(result)
    from_db.append(values)
columns = ["order_id","customer_name","product_name","date_ordered","unit_price","phone_number"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,unit_price,phone_number
0,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
1,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
2,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
3,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
4,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
5,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."
6,"(101, Sahil, Laptop, 2002-12-02, 2, 800.0, 808...","(106, Disha, Headphone, 2018-08-20, 10, 300.0,...","(103, Soham, Tab, 2019-12-25, 5, 50.0, 8976123...","(105, Mansi, TV, 2019-05-30, 6, 48.0, 8865316698)","(104, Ninadh, Phone, 2018-07-14, 7, 30.0, 7368...","(102, Jayesh, Book, 2019-02-10, 10, 12.0, 8369..."